## Pandas

* Pandas is used to analyse data & big data and make conclusion based on 
  statistical theories.
  
* Pandas is typically used to clean messy data & make them readable & simple to
  access.
  
* It cal also help us in finding relationship between columns (co-relation)

* It can also be used in doing all statistical methodologies as well as plotting 
  and creating graphs.

In [1]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.2.4'

### Series

* A series is a 1-Dimensional array like object, containing a sequence of values
  (of similar data types) and an associated array of data labels called as indexes.

In [4]:
obj = pd.Series([10,20,30,40])

In [5]:
obj

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
import numpy as np

arr = np.array([10,20,30,40])

In [7]:
arr

array([10, 20, 30, 40])

In [8]:
# defining your own keys

obj2 = pd.Series([10,20,30,40],index=['d','b','a','c'])

In [9]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [10]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [11]:
obj

0    10
1    20
2    30
3    40
dtype: int64

In [12]:
obj[2]

30

In [13]:
obj[3]

40

In [14]:
obj[3] = 100

In [15]:
obj

0     10
1     20
2     30
3    100
dtype: int64

In [16]:
obj[0:3] = 4332

In [17]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [18]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [19]:
obj2['a']

30

In [20]:
obj2[2]

30

In [21]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [22]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [24]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [25]:
obj[[0,2,3]]

0    4332
2    4332
3     100
dtype: int64

In [26]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [27]:
obj2[['d','c']]

d    10
c    40
dtype: int64

In [28]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [29]:
obj2 > 20

d    False
b    False
a     True
c     True
dtype: bool

In [30]:
res = obj2[obj2 > 20]

In [31]:
res

a    30
c    40
dtype: int64

In [32]:
type(res)

pandas.core.series.Series

In [33]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [34]:
obj2+5

d    15
b    25
a    35
c    45
dtype: int64

In [35]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [36]:
obj2 - 2

d     8
b    18
a    28
c    38
dtype: int64

In [37]:
obj2 * 2

d    20
b    40
a    60
c    80
dtype: int64

In [38]:
obj2 / 2

d     5.0
b    10.0
a    15.0
c    20.0
dtype: float64

## creating series from python dictionary

In [39]:
data = {
    'Mumbai':1000,
    'Delhi':7500,
    'Nagpur':5000,
    'Chennai':3212
}

In [40]:
data

{'Mumbai': 1000, 'Delhi': 7500, 'Nagpur': 5000, 'Chennai': 3212}

In [41]:
obj4 = pd.Series(data)

In [42]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [43]:
data_2 = {
    'city':['Mumbai','Pune','Chennai'],
    'salary':[3500,4500,6000]
}

In [44]:
data_2

{'city': ['Mumbai', 'Pune', 'Chennai'], 'salary': [3500, 4500, 6000]}

In [45]:
obj5 = pd.Series(data_2)

In [46]:
obj5

city      [Mumbai, Pune, Chennai]
salary         [3500, 4500, 6000]
dtype: object

In [47]:
type(obj5['city'])

list

In [48]:
type(obj5)

pandas.core.series.Series

In [49]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [50]:
data

{'Mumbai': 1000, 'Delhi': 7500, 'Nagpur': 5000, 'Chennai': 3212}

In [51]:
cities = ['Mumbai','Delhi','Nagpur','Chennai','Ahmedabad']

In [52]:
obj5 = pd.Series(data,index=cities)

In [53]:
obj5

Mumbai       1000.0
Delhi        7500.0
Nagpur       5000.0
Chennai      3212.0
Ahmedabad       NaN
dtype: float64

In [54]:
pd.isnull(obj5)

Mumbai       False
Delhi        False
Nagpur       False
Chennai      False
Ahmedabad     True
dtype: bool

In [55]:
pd.notnull(obj5)

Mumbai        True
Delhi         True
Nagpur        True
Chennai       True
Ahmedabad    False
dtype: bool

In [56]:
obj5[pd.notnull(obj5)]

Mumbai     1000.0
Delhi      7500.0
Nagpur     5000.0
Chennai    3212.0
dtype: float64

In [57]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [58]:
obj5

Mumbai       1000.0
Delhi        7500.0
Nagpur       5000.0
Chennai      3212.0
Ahmedabad       NaN
dtype: float64

In [59]:
obj4+obj5

Ahmedabad        NaN
Chennai       6424.0
Delhi        15000.0
Mumbai        2000.0
Nagpur       10000.0
dtype: float64

In [60]:
ser1 = pd.Series(20,index=['chennai'])

In [61]:
ser2 = pd.Series(40,index=['Chennai'])

In [62]:
ser1

chennai    20
dtype: int64

In [63]:
ser2

Chennai    40
dtype: int64

In [64]:
ser1+ser2

Chennai   NaN
chennai   NaN
dtype: float64

### DataFrames

* A dataframe represents a rectangular table of data & contains 
  ordered collection of columns which can be of a different data type


* The DataFrame has both row & column index, it can be thought
  as a dictionary of series, all sharing the same index.
  
  
  
* The data is stored as one or more 2-D block.

<img src="https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png" width=300px; height=300px;>

In [65]:
data_1 = {
    'State':['Mumbai','Pune','Chennai','Delhi','Nagpur'],
    'year':[2001,2011,2018,2019,2020],
    'pop':[1.5,1.7,3.6,2.4,3.2]
}

In [66]:
data_1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'pop': [1.5, 1.7, 3.6, 2.4, 3.2]}

In [67]:
pd.Series(data_1)

State    [Mumbai, Pune, Chennai, Delhi, Nagpur]
year             [2001, 2011, 2018, 2019, 2020]
pop                   [1.5, 1.7, 3.6, 2.4, 3.2]
dtype: object

In [68]:
df = pd.DataFrame(data_1)

In [69]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [70]:
df.style.set_table_styles(
[{'selector':'tr:hover',
  'props':[('background-color','yellow')]
 }]
)

In [71]:
df.head()

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [72]:
df.head(3)

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6

In [73]:
df.tail(2)

    State  year  pop
3   Delhi  2019  2.4
4  Nagpur  2020  3.2

In [74]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [75]:
data_1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'pop': [1.5, 1.7, 3.6, 2.4, 3.2]}

In [76]:
df2 = pd.DataFrame(data_1,columns=['State','year','pop','debt'],
                  index=['one','two','three','four','five'])

In [77]:
df2

         State  year  pop debt
one     Mumbai  2001  1.5  NaN
two       Pune  2011  1.7  NaN
three  Chennai  2018  3.6  NaN
four     Delhi  2019  2.4  NaN
five    Nagpur  2020  3.2  NaN

In [78]:
df2.columns

Index(['State', 'year', 'pop', 'debt'], dtype='object')

In [79]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [80]:
df2.columns = ['STATE','YEAR','POP','DEBT']

In [81]:
df2

         STATE  YEAR  POP DEBT
one     Mumbai  2001  1.5  NaN
two       Pune  2011  1.7  NaN
three  Chennai  2018  3.6  NaN
four     Delhi  2019  2.4  NaN
five    Nagpur  2020  3.2  NaN

In [82]:
df2['STATE']  #fetching the data column wise

one       Mumbai
two         Pune
three    Chennai
four       Delhi
five      Nagpur
Name: STATE, dtype: object

In [83]:
type(df2['STATE'])

pandas.core.series.Series

In [84]:
df2[['STATE','POP']]   #fetching multiple columns

         STATE  POP
one     Mumbai  1.5
two       Pune  1.7
three  Chennai  3.6
four     Delhi  2.4
five    Nagpur  3.2

In [85]:
df2['DEBT']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
Name: DEBT, dtype: object

In [86]:
df2['DEBT'] = 16

In [87]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5    16
two       Pune  2011  1.7    16
three  Chennai  2018  3.6    16
four     Delhi  2019  2.4    16
five    Nagpur  2020  3.2    16

In [88]:
df2['DEBT'] = np.arange(1,6)

In [89]:
df2['DEBT']

one      1
two      2
three    3
four     4
five     5
Name: DEBT, dtype: int64

In [90]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
two       Pune  2011  1.7     2
three  Chennai  2018  3.6     3
four     Delhi  2019  2.4     4
five    Nagpur  2020  3.2     5

In [91]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
two       Pune  2011  1.7     2
three  Chennai  2018  3.6     3
four     Delhi  2019  2.4     4
five    Nagpur  2020  3.2     5

In [92]:
df2.loc['three']

STATE    Chennai
YEAR        2018
POP          3.6
DEBT           3
Name: three, dtype: object

In [93]:
type(df2.loc['three'])

pandas.core.series.Series

In [94]:
df2.loc[['one','five']]  #fetching multiple rows

       STATE  YEAR  POP  DEBT
one   Mumbai  2001  1.5     1
five  Nagpur  2020  3.2     5

In [95]:
df2.iloc[0]  #fetching row wise data on basis of default index value

STATE    Mumbai
YEAR       2001
POP         1.5
DEBT          1
Name: one, dtype: object

In [96]:
df2.iloc[[0,2]]

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
three  Chennai  2018  3.6     3

In [97]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [98]:
df['Western'] = df['State'] == 'Mumbai'

In [99]:
df

     State  year  pop  Western
0   Mumbai  2001  1.5     True
1     Pune  2011  1.7    False
2  Chennai  2018  3.6    False
3    Delhi  2019  2.4    False
4   Nagpur  2020  3.2    False

In [100]:
del df['Western']

In [101]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

### index objects

In [102]:
obj = pd.Series(range(3),index=['a','b','c'])

In [103]:
obj

a    0
b    1
c    2
dtype: int64

In [104]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [105]:
my_index = obj.index

In [106]:
my_index

Index(['a', 'b', 'c'], dtype='object')

In [107]:
my_index[0]

'a'

In [108]:
my_index[1]

'b'

In [111]:
my_index[0]

'a'

In [112]:
my_index[0] = 'D'

TypeError: Index does not support mutable operations

In [113]:
obj1 = pd.Series([4.1,7.5,-8.3,3.6],index=['d','a','b','c'])

In [114]:
obj1

d    4.1
a    7.5
b   -8.3
c    3.6
dtype: float64

In [115]:
obj1 = obj1.reindex(['a','b','c','d'])

In [116]:
obj1

a    7.5
b   -8.3
c    3.6
d    4.1
dtype: float64

In [117]:
obj3 = pd.Series(['blue','purple','red'],index=[0,2,4])

In [118]:
obj3

0      blue
2    purple
4       red
dtype: object

In [121]:
obj4 = obj3.reindex(range(7),method='ffill')

In [122]:
obj4

0      blue
1      blue
2    purple
3    purple
4       red
5       red
6       red
dtype: object

In [123]:
obj5 = obj3.reindex(range(6),method='bfill')

In [124]:
obj5

0      blue
1    purple
2    purple
3       red
4       red
5       NaN
dtype: object

## dropping entries in series

In [125]:
obj6 = pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [126]:
obj6

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [127]:
obj6.drop('c')

a    0
b    1
d    3
e    4
dtype: int64

In [128]:
obj6

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [129]:
obj6.drop(['a','d'])

b    1
c    2
e    4
dtype: int64

In [130]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['Mumbai','Pune','Chennai','Delhi'],
                   columns=['one','two','three','four'])

In [131]:
data

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [132]:
data.drop(['Pune','Chennai'])

        one  two  three  four
Mumbai    0    1      2     3
Delhi    12   13     14    15

In [133]:
data

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [134]:
data

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [135]:
#to drop a column in data frame

data.drop('three',axis=1)

         one  two  four
Mumbai     0    1     3
Pune       4    5     7
Chennai    8    9    11
Delhi     12   13    15

In [136]:
data.drop(['one','four'],axis=1)

         two  three
Mumbai     1      2
Pune       5      6
Chennai    9     10
Delhi     13     14

In [137]:
#to drop a column in data frame

data.drop('three',axis=1,inplace=True)

In [138]:
data

         one  two  four
Mumbai     0    1     3
Pune       4    5     7
Chennai    8    9    11
Delhi     12   13    15

In [139]:
df3 = pd.DataFrame(np.arange(9).reshape(3,3),
                  columns=['b','c','d'],
                  index=['Mumbai','Pune','Nagpur'])

In [140]:
df3

        b  c  d
Mumbai  0  1  2
Pune    3  4  5
Nagpur  6  7  8

In [141]:
df4 = pd.DataFrame(np.arange(12).reshape(4,3),
                  columns=['b','d','e'],
                  index=['Delhi','Mumbai','Pune','Chennai'])

In [142]:
df4

         b   d   e
Delhi    0   1   2
Mumbai   3   4   5
Pune     6   7   8
Chennai  9  10  11

In [146]:
df6  = df3+df4

In [145]:
df3.add(df4,fill_value=0)

           b    c     d     e
Chennai  9.0  NaN  10.0  11.0
Delhi    0.0  NaN   1.0   2.0
Mumbai   3.0  1.0   6.0   5.0
Nagpur   6.0  7.0   8.0   NaN
Pune     9.0  4.0  12.0   8.0

In [148]:
df6.fillna(0)

           b    c     d    e
Chennai  0.0  0.0   0.0  0.0
Delhi    0.0  0.0   0.0  0.0
Mumbai   3.0  0.0   6.0  0.0
Nagpur   0.0  0.0   0.0  0.0
Pune     9.0  0.0  12.0  0.0

In [149]:
df6

           b   c     d   e
Chennai  NaN NaN   NaN NaN
Delhi    NaN NaN   NaN NaN
Mumbai   3.0 NaN   6.0 NaN
Nagpur   NaN NaN   NaN NaN
Pune     9.0 NaN  12.0 NaN

## functions & mapping

In [150]:
df1 = pd.DataFrame(np.random.randn(4,3),
                  columns=['b','d','e'],
                  index=['Mumbai','Chennai','Delhi','Nagpur'])

In [151]:
df1

                b         d         e
Mumbai   1.103642 -0.063557  1.463831
Chennai  0.021173  0.896067  0.017327
Delhi   -1.189485  0.663739 -0.163285
Nagpur  -0.023331  0.639016  0.375389

In [153]:
df1['b'].min()

-1.1894851988076753

In [154]:
df1['b'].max()

1.1036423516438962

In [155]:
difference = lambda x:x.max() - x.min()

In [156]:
difference

In [169]:
ser = df1.apply(difference,axis=0)  #col wise

In [170]:
ser

b             2.293128
d             0.959624
e             1.627116
difference    1.190877
dtype: float64

In [158]:
df1

                b         d         e
Mumbai   1.103642 -0.063557  1.463831
Chennai  0.021173  0.896067  0.017327
Delhi   -1.189485  0.663739 -0.163285
Nagpur  -0.023331  0.639016  0.375389

In [160]:
type(df1['b'])

pandas.core.series.Series

In [161]:
df1.apply(difference,axis=1) #row wise

Mumbai     1.527388
Chennai    0.878741
Delhi      1.853224
Nagpur     0.662347
dtype: float64

In [163]:
df1['difference'] = df1.apply(difference,axis=1) #row wise

In [164]:
df1

                b         d         e  difference
Mumbai   1.103642 -0.063557  1.463831    1.527388
Chennai  0.021173  0.896067  0.017327    0.878741
Delhi   -1.189485  0.663739 -0.163285    1.853224
Nagpur  -0.023331  0.639016  0.375389    0.662347

In [168]:
df1.append(ser,ignore_index=True)

          b         d         e  difference
0  1.103642 -0.063557  1.463831    1.527388
1  0.021173  0.896067  0.017327    0.878741
2 -1.189485  0.663739 -0.163285    1.853224
3 -0.023331  0.639016  0.375389    0.662347
4  2.293128  0.959624  1.627116    1.190877

In [171]:
df1

                b         d         e  difference
Mumbai   1.103642 -0.063557  1.463831    1.527388
Chennai  0.021173  0.896067  0.017327    0.878741
Delhi   -1.189485  0.663739 -0.163285    1.853224
Nagpur  -0.023331  0.639016  0.375389    0.662347

In [172]:
df1['difference']

Mumbai     1.527388
Chennai    0.878741
Delhi      1.853224
Nagpur     0.662347
Name: difference, dtype: float64

In [178]:
round1 = lambda x : "{:.2f}".format(x)

In [179]:
df1['difference'].apply(round1)

Mumbai     1.53
Chennai    0.88
Delhi      1.85
Nagpur     0.66
Name: difference, dtype: object

In [194]:
round2 = lambda x :round(x,2)

In [198]:
round2(12.44,2)

TypeError: <lambda>() takes 1 positional argument but 2 were given